####set-集合-自动去重
##基本操作
#无序的,不可重复,可修改的数据容器
#定义集合
s1={'c','d','x','t','o','u'}
#定义空集合
s2=set()#不可以用{},{}是用来定义空字典的

#常用方法
s1 ={100,200,300,400,500,600,700,800}
#add()-->添加元素到集合中
s1.add(1200)
print(s1)#{800, 100, 200, 300, 400, 1200, 500, 600, 700}
#remove()-->移除集合中的指定元素
s1.remove(800)
print(s1)#{100, 200, 300, 400, 1200, 500, 600, 700}
#pop()-->速记删除集合中的元素并返回
e = s1.pop()
print(e)#100
print(s1)#{200, 300, 400, 1200, 500, 600, 700}
# #clear()-->清空集合
# s1.clear()
# print(s1)#set()
#differnece()-->求两个集合的差集(包括在第一个集合但不在第二个集合的元素)
s2 = {100,500,700,800,900,1000}
print(s1.difference(s2))#{200, 300, 400, 1200, 600}
print(s2.difference(s1))#{800, 900, 100, 1000}
#union()-->求取两个集合的合集
print(s2.union(s1))#{800, 100, 900, 1000, 200, 300, 400, 1200, 500, 600, 700}
print(s1.union(s2))#{800, 100, 900, 1000, 200, 300, 400, 1200, 500, 600, 700}
#intersection()-->求取两个集合的交集
print(s2.intersection(s1))
print(s1.intersection(s2))