####面向过程--是一种编程思想，强调的是以步骤（过程）为基础完成的各种操作

####面向对象：他是一种编程思想，强调的是以对象为基础完成的各种操作，它是基于面向过程的
#特点：1.更符合人们的思考习惯 2.把复杂的事情简单化 3.把人们从执行者变成指挥者
#举例：越符合当时的场景越好
#总结：万物皆对象

#封装(Encapsulation)：将属性（名词）和方法（动词）封住在一起，仅提供对外的方法让别人去访问--简化编程
#class 类名： --- 隐藏对象的属性和实现细节，仅对外公开接口，形成一个有机的整体
    #属性，名词
    #方法，动词
#好处：提供代码的安全性（private），提高代码的复用性（function）
#坏处：代码的复杂性加强了

#继承(Inheritance)：子类可使用父类的对象--代码复用-->子类继承父类的属性和方法（is - a关系）
#好处：提高代码的复用性
#坏处：提高了耦合性，A类和B类的关系绑定死了

#多态(Polymorphism)：同一个函数在不同场景下表现出不同形态--解耦合，可拓展-
#同一个函数，接收不同的对象，有不同的效果


#类和对象的概念--根据类的模板再创建一个具体对象，再用对象干活
#类：对现实事物的抽象描述--一个模板，必须有跑起来（可以用的）的行为
#对象：现实事物的具体体现
#创建python类
#调用类

#Self是python内置的关键字，用于指向对象实例本身

"""属性：表示的是固有特征，在python中用变量表示
类外：
    设置属性：
        对象名.属性 = 属性值
        car.color = 'red' #定义属性，并给属性color赋值
        car.number =4     #给属性number赋值
    获取属性值：
        对象名.属性
        print("颜色：%s"% car.color)
        print("轮胎数：%d"%car.number)
"""